In [1]:
import numpy as np
import pandas as pd

a={
    "Name":["Bishop","Sourav","ritabhari","Trishit"],
    "age":[20,23,25,24],
    "gender":["male","male","female",np.nan],
    "occupation":["data scientist",np.nan,"Actress",np.nan]
    
}

In [2]:
c=pd.DataFrame(a)
a

{'Name': ['Bishop', 'Sourav', 'ritabhari', 'Trishit'],
 'age': [20, 23, 25, 24],
 'gender': ['male', 'male', 'female', nan],
 'occupation': ['data scientist', nan, 'Actress', nan]}

In [3]:
c

        Name  age  gender      occupation
0     Bishop   20    male  data scientist
1     Sourav   23    male             NaN
2  ritabhari   25  female         Actress
3    Trishit   24     NaN             NaN

In [4]:
c["Name"]=[i.upper() for i in c["Name"]]

In [5]:
c

        Name  age  gender      occupation
0     BISHOP   20    male  data scientist
1     SOURAV   23    male             NaN
2  RITABHARI   25  female         Actress
3    TRISHIT   24     NaN             NaN

In [6]:
c["age"]=[i if i<24 else i+10 for i in c["age"]]

In [7]:
c

        Name  age  gender      occupation
0     BISHOP   20    male  data scientist
1     SOURAV   23    male             NaN
2  RITABHARI   35  female         Actress
3    TRISHIT   34     NaN             NaN

In [8]:
c["age"]=[i if i<24 else i-10 for i in c["age"]]
c

        Name  age  gender      occupation
0     BISHOP   20    male  data scientist
1     SOURAV   23    male             NaN
2  RITABHARI   25  female         Actress
3    TRISHIT   24     NaN             NaN

In [9]:
a

{'Name': ['Bishop', 'Sourav', 'ritabhari', 'Trishit'],
 'age': [20, 23, 25, 24],
 'gender': ['male', 'male', 'female', nan],
 'occupation': ['data scientist', nan, 'Actress', nan]}